# n = int(input())
# n %= 86400          #n приравнивается к остатку от деления на 86400 (секунд в сутках)
# m = n % 3600        #m приравнивается к остатку от деления секунд от начала дня на 60*60 секунд
# print('{}:{:02d}:{:02d}'.format(n // 3600, m // 60, m % 60))

v = int(input())
H = v // 3600
M = (v % 3600) // 60
S = (v % 3600) % 60
b = H / 24
if b == int(b) and b > 0:
    H = 0
elif H > 24:
    H = H - 24 * (H // 24)
if M < 10:
    M = "0" + str(M)
if S < 10:
    S = "0" + str(S)
print(H, ":", M, ":", S, sep="")
